Repository: hpb-htw/python-beginners
Catalog: source/locale/*/LC_MESSAGES/where_to_go.po
Languages: de

source: Where to go from here
de: Wie es weiter geht

source: Learning Python
de: Python lernen

source: Hopefully this tutorial has tought you just enough python to get you on your feet. However, there is much more that you can learn! Even professional programmers will always be trying to learn more about their language and how to code excellently with it.
de: Hoffentlich hat diese Tutorial dir genug Python beigebracht um auf eigenen Füßen stehen zu können. Trotzdem gibt es immer noch mehr zu lernen! Auch professionele Programmierer probieren ständig mehr über ihre Sprache und wie man mit ihr exzellent programmiert zu lernen.

source: Books and Tutorials
de: Bücher und Tutorials

source: If you like learning from a book, there are heaps of good ones, and even many that can be read freely on the web!
de: Falls du Lernen mit Büchern magst, gibt es tonnen guter Bücher. Einige sind sogar kostenlos im Internet lesbar!

source: `OTS Python Portal`_ - Check the rest of our tutorials, and look out for future workshops!
de: `OTS Python Portal`_ - Schau dir den Rest unserer Tutorials an, und halte Ausschau nach zukünftigen Workshops!

source: `O'Reilly`_ publishes hundreds of books and ebooks, on python and many other technologies (check out Learning Python, 5th edition).
de: `O'Reilly`_ veröffentlicht hunderte von Büchern und Ebooks, über Python und viele andere Technologien (schau dir die Einführung in Python oder das englische Original, Learning Python (5. Auflage), an).

source: `Invent with Python`_ takes a practical approach, with three different ebooks that can be read online for free.
de: `Invent with Python`_ ist sehr praxisorientiert, mit drei verschiedenen Ebooks die online umsonst gelesen werden können.

source: `Learn Python the Hard Way`_ is a step by step full tutorial on the language, done in a unique style.
de: `Learn Python the Hard Way`_ ist eine Schritt-für-Schritt-Einführung in die Sprache mit einem einzigartigen Stil.

source: `Dive into Python 3`_ is another great book available online for free!
de: `Dive into Python 3`_ ist ein anderes großartiges Buch das online umsonst erhältlich ist!

source: Last but not least, python.org has `Its own tutorial!`_
de: Zuguterletzt hat python.org sein `eigenes Tutorial!`_

source: Online learning courses
de: Onlinekurse

source: You wouldn't believe what you can do on the web these days. There are many courses on programming around!
de: Du wirst nicht glauben was es heutzutage alles im Web gibt. Man findet viele Kurse über Programmieren!

source: `Edx`_ - with top universities like Stanford, MIT, Harvard and Berkley giving out interactive courses for free, it's hard to turn this down. You'll have to look for ones coming up soon!
de: `Edx`_ - zu interaktiven, kostenlosen Kursen von Spitzenuniversitäten wie Stanford, dem MIT, Harvard und Berkeley lässt sich nur schwer nein sagen. Halt Ausschau nach demnächst anstehenden Kursen!

source: `Coursera`_ is very similar to Edx, with even more courses, and some that can be taken at any time.
de: `Coursera`_ ist sehr ähnlich zu Edx, mit noch mehr Kursen, und manche können sogar jederzeit genommen werden.

source: `CodeAcademy`_ - luckily this one has a python-specific course that can be taken at any time, and many other practical language courses.
de: `CodeAcademy`_ - glücklicherweise hat diese einen Python-spezifischen Kurs den man jederzeit nehmen kann, und viele andere praktische Sprachkurse.

source: What to do with Python
de: Was man mit Python machen kann

source: Well, that's a tough one! See, practically anything you can think of involving some electronics - from your TV remote, to a smartphone, to the backend of a popular web service, to the scheduling of airport landings, to the software you use everyday - it all involves some programming somewhere!
de: Nunja, das ist eine gute Frage! Schau, praktisch alles was du dir vorstellen kannst, was auch nur entfernt mit Elektronik zu tun hat -- von deiner Fernbedienung, über ein Smartphone, das Backend eines populären Webdienstes, das Planen von Flugzeuglandungen, bis zur Software die du jeden Tag nutzt -- es hat alles etwas mit Programmieren zu tun!

source: And not only is it a big field practically, but also technically and academically. As soon as you have a basic understanding of a general language like python, you can start working on all manner of subjects: web frontends, web backend services, data analysis and statistics, Artificial Intelligence, GUI design, robotics, software development of all kinds, online transactions, automation of everything, and many more.
de: Und es ist nicht nur ein großes praktisches Feld, sondern auch ein technisches und akademisches. Sobald du ein generelles Verständnis von einer grundlegenden Sprache wie Python hast, kannst du an allen möglichen Themen arbeiten: Webfrontends, Webbackend-Dienste, Datenanalyse und Statistiken, künstliche Intelligenz, GUI-Design, Robotik, Softwareentwicklung aller Arten, Onlinetransaktionen, Automatisierung von allem, und viel mehr.

source: We wouldn't blame if that all sounds daunting, so here's some practical advice, that takes advantage of how wide a field "programming" is:
de: Wir können verstehen wenn das einschüchternd klingt, also ist hier ein praktischer Ratschlag der Nutzen aus der Größe des Felds „Programmieren“ zieht:

source: **Apply your new skills to whatever you're passionate about.**
de: **Benutz deine neuen Fähigkeiten wofür auch immer du Leidenschaft hast.**

source: Whether that's starting a new business, helping you do some task involving data faster, putting up an online site, calculating advantages in a game you play, creating art and music, or anything else, finding out how to use programming to help with whatever floats your boat will make learning much more exciting and relevant. Feel free to ask someone more experienced if you have no idea where to start, but always mention what makes you tick!
de: Ob das heißt ein neues Geschäft zu starten, dir zu helfen eine Aufgabe mit Daten schneller zu bewältigen, eine Seite online zu schalten, Vorteile in einem Spiel zu berechnen, Kunst und Musik zu erstellen, oder irgendetwas anderes, herauszufinden wie dir Programmieren in deinen Hobbies helfen kann macht das Lernen viel spannender und relevanter. Frag ruhig jemanden mit mehr Erfahrung falls du keine Idee zum Weitermachen hast, aber behalt immer deine Interessen im Auge.
